
let sakeName = ["播州一献 純米 超辛口720ml (반슈잇콘 준마이 초카라쿠치)", "蒼空 純米酒 美山錦 1800ml (소쿠 준마이 미야마니시키)", "赤武 AKABU 純米酒 1800ml (아카부 준마이)", "かまいたち 純米 辛口原酒 1800ml (카마이타치)", "七田(しちだ) 純米 無濾過 1800ml (시찌다 준마이)", "こなき純米 辛口 山田錦 1800ml (코나키 준마이)",
"亀の海 超辛口純米 1800ml (카메노우미 준마이)", "W(ダブリュー) 純米 亀の尾 無濾過生原酒 1800ml【クール便推奨】 (더블유 준마이 카메노싯포)", "ばくれん 超辛口吟醸 1800ml (바쿠렌 초카라쿠치 긴죠)", "出羽桜 桜花吟醸酒 1800ml (데와자쿠라 사쿠라하 긴죠)", "出雲富士 吟 本生 1800ml (이즈모 후지 긴 혼쇼우)", "久保田千寿 吟醸 1800ml (쿠보타센쥬 긴죠)",
"黒龍 いっちょらい 1.800ml (코쿠류 잇쵸라이)", "菊姫 吟醸あらばしり 1800ml (키쿠히메 긴죠 아라바시리)", "美丈夫 吟醸 秋酒 1800ml (비조후 긴죠 아키사케)", "越乃寒梅 吟醸酒 特撰 1800ml (코시노 칸바이 긴죠 특선)", "雅山流 大吟醸 如月 1800ml (가산류 다이긴죠 키사라기)",
"牧之(ぼくし) 限定 大吟醸 生詰め原酒 720ml (보쿠시 한정 다이긴죠 나마즈메 겐슈 )", "くどき上手 大吟醸 720ml  (쿠도키죠즈 다이긴죠)", "出羽桜 雪漫々 大吟醸 1800ml  (데와자쿠라 유키만만 다이킨죠)", "越乃景虎 金銘泉 特撰大吟醸1800ml  (코시노카게토라)", "雨後の月 大吟醸 金賞受賞酒 720ml  (우고노츠키 다이긴죠)", "真澄 大吟醸 オーク樽熟成 720ml  (마스미 다이긴죠)", "筰 大吟醸 滴取り 750ml  (자쿠 다이긴죠)",
"裏雅山流 本醸造生詰 香華 1800ml (우라가산류 혼죠조나마즈메 코우카)", "若波本醸造しぼりたて 1800ml (와카나미 혼죠조 시보리타테)", "千代の光 本醸造 1800ml (치요노히카리 혼죠조)", "甲子しぼりたて生 1800ml (키노에네 시보리타테 생)", "蓬莱(ほうらい) ひだほまれ酒米づくり研究会 1800ml (호라이 히다호마레 사카마이즈쿠리 연구회)", "なぶら 1800ml (나부라)",
"夜明け前 からくち 1800ml (요아케마에)", "不老泉 1800ml (불로천)"];

let sakeJujosa = ["산요하이주조 山陽盃酒造", "후지오카주조 藤岡酒造", "아카부주조 赤武酒造", "스기 이사오 와리바라 주조 杉勇蕨岡酒造", "텐잔주조 天山酒造", "치요무스비주조 千代むすび酒造",
"츠치야 土屋酒造店", "와타나베주조 渡辺酒造店", "카메노이주조 亀の井酒造", "데와자쿠라주조 出羽桜酒造", "후지주조 富士酒造", "아사히주조 朝日酒造",
"코쿠류주조 黒龍酒造", "키쿠히메합산회사 菊姫合資会社", "하마카와쇼텐 濱川商店", "이시모토주조 石本酒造", "신도우주조 新藤酒造", "아오키주조 青木酒造",
"카메노이주조 亀の井酒造", "데와자쿠라주조 出羽桜酒造", "모로하시주조 諸橋酒造", "아이하라주조 相原酒造", "미야사카주조 宮坂醸造", "시미즈세자부로상점 清水清三郎商店",
"신도우주조 新藤酒造", "와카나미 주조 若波酒造", "치요노히카리주조 千代の光酒造", " 이이누마본가 飯沼本家", "와타나베주조점 渡辺酒造店", "교쿠센도주조 玉泉堂酒造",
"오노주조점 小野酒造店", "우에하라주조 上原酒造"];

let sakeJujoArea = ["효고현 兵庫県", "교토시 京都市", "이와테현 岩手県", "야마가타현 山形県", "사가현 佐賀県", "돗토리현 鳥取県",
"나가노현 長野県", "기후현  岐阜県", "야마가타현 山形県", "야마가타현 山形県", "시마네현 島根県", "니가타현 新潟県",
"후쿠이현 福井県", "이시카와현  石川県", "코치현 高知県", "니가타현  新潟県",  "야마가타현  山形県", "니가타현 新潟県",
"야마가타현  山形県", "야마가타현 山形県", "니가타현 新潟県", "히로시마현 広島県", "나가노현 長野県", "미에현 三重県",
"야마가타현  山形県", "후쿠오카현 福岡県", "니가타현 新潟県", "치바현 千葉県", "기후현 岐阜県", "기후현 岐阜県", 
"나가노현 長野県", "시가현 滋賀県"];

let sakeDosu = ["16", "15~16", "15~16", "17", "17", "16", "15", "17", "17~18", "15", "17", "15", "17", "17", "15", "16", "14~15", "17", "15.5", "15", "17 ~ 18", "16", "17", "17",
"14~15", "15", "15", "18", "15.5", "14 ~ 15", "15", "17"];

let sakePrice = ["60,000", "78,000", "85,000", "80,000", "90,000", "62,000", "50,000", "103,000", "45,000", "57,800", "95,000", "72,000",
"57,000", "80,000", "53,000", "93,000", "70,000", "130,000", "90,000", "103,000", "190,000", "118,000", "300,000", "1,000,000", "90,000", "90,000",
"50,000", "48,000", "39,000", "30,000", "38,000", "58,000"];

let sakeDescript = ["효고현 산(兵庫県産)【호쿠니시키(北錦)】를 100% 사용하여, 저온 장기 발효 *모로미에 의한 매콤한 맛을 표현하고 있습니다. <br> 날카로운 신맛과 부드러운 뒷맛을 즐기실 수 있습니다. <br> 차갑게서부터 뜨겁게까지 다양한 온도대에서 맛보실 수 있는 술입니다. <br><br> *모로미 : 아직 거르지 않은 술이나 간장",
"부드럽고 상큼한 맛이 있으며, 약간의 멜론 향과 함께 부드럽고 균형 잡힌 맛이 펼쳐지며, 가벼운 입가심을 선사합니다. <br> 뒷맛은 깔끔하게 사라져 맑은 하늘처럼 청명하고 맑은 맛을 즐길 수 있습니다.",
"이와테현산에서 60%정도를 *세밈하여 증류한 순미주입니다. <br> 하얀 복숭아를 연상시키는 향에서 느껴지는 자몽과 같은 상쾌한 과일향과 산미가 밸런스 있게 어우러져, 순미주다운 풍미를 적당히 높여주면서도 투명하고 선명한 맛, 샤프한 후각이 식사 중에도 잘 어울립니다. <br><br> *세밈 : 쌀의 겉 부분을 정밀하게 제거하는 과정",
"야마가타현산의 미야마누리를 100% 사용하여 순수한 양조주 수준의 55%로 정교하게 거름으로써 만들어진 고급스러운 풍미가 깊은 순미주입니다. <br> 쌀의 풍미를 충분히 느끼지만, 매운 맛 속에는 우아함이 감도며, 부드럽고 깔끔한 맛을 즐길 수 있습니다.",
"쌀의 풍미를 부드럽게 느낄 수 있으면서도, 너무 강하지 않고 부담스럽지 않은 술입니다. <br> 적절한 산미와 입안을 즐겁게 하는 여운, 세련된 맛의 확산이 매력적인 순미주입니다. 상쾌한 과일향과 쌀의 풍미가 조화롭게 어울립니다. <br> 세련된 단맛 속에서도 산미와 경쾌한 풍미를 느끼며, 샤프한 입안감이 눈을 뗄 수 없을 정도입니다. <br> 다양한 요리와 잘 어울리는 술입니다.",
"인기 있는 요괴 만화에 나오는 캐릭터 '코나키 삼촌'의 라벨이 특징적인 풍미가 깊은 맛의 술입니다. <br> '적코나키'로 친근하게 불리우는 '코나키 순미'의 다른 버전으로, 야마다니 쌀을 사용한 풍미가 깊은 맛입니다. 일반적인 고마린과는 다르게 풍부한 맛과 단단한 후각이 특징이죠. <br> 여전히 강렬한 맛과 특유의 매운 맛이 느껴지는데요. <br> 친숙한 외모와 함께 인상적인 맛과 만족스러운 매운 맛으로 많은 팬을 끌어들이는 술입니다.",
"단단하고 깔끔한 맛이 입안을 가득 채우면서도 부드럽게 느껴집니다. <br> 쌀의 풍미나 단맛은 느껴지지 않고, 약간의 쌀과 술의 부드러운 풍미가 조금씩 살아있습니다. <br> 차갑게 마시거나 온도를 올려 뜨거운 술로 즐길 수 있으며, 어떤 안주와도 잘 어울립니다.",
"미래의 일본주(日本酒)를 책임질 엄선된 주류 매장을 위해 양조된, 수량 한정의 주문 제작품인 와타나베 주조점의 'W 시리즈'입니다. <br> 브랜드명 'W'는 와타나베 주조(Watanabe), 세계(World), 웃음(Warai)이라는 세 가지 의미를 나타냅니다. <br> W(더블유) 깃털은 멜론과 같은 풍부한 향 속에 가볍게 견과류 향이 미묘하게 느껴집니다. <br> 그 복잡한 향과 산미, 쌉싸름한 맛이 적절하게 어우러집니다. <br> W 시리즈'는 쌀을 50%까지 세밀하게 연마한 <br><br> *순미 대금이지만, 순미주로 분류됩니다. <br> 이는 'W 시리즈'가 추구하는 본질과 관련하여 연마 비율을 줄이거나 숫자를 조작하지 않는다고 생각하기 때문입니다. ",
"약간의 과일 향과 경쾌하면서도 매우 매끄러운 맛이 특징이며, 그저 매운 것 뿐만이 아니라 밸런스가 잘 잡혀 있어, 좋은 의미로 매운 맛을 느끼는 듯하지 않고 즐거운 맛을 제공합니다. 이 술은 전국적으로 약 10군데 정도의 주점에서만 판매되는 소수의 주류입니다.",
"숙성한 과일향이 퍼지고 부드러운 단맛이 느껴지는 입맛입니다. <br> 온화한 단맛과 풍미가 입 안에 퍼지며, 적당한 쌀의 맛 속에 약간의 쓴맛과 부드러운 산미가 있습니다. <br> 화려한 인상 속에서도, 긴조 특유의 섬세한 주질과 끝맛이 있으며, 마시고 싫어지지 않는 타입입니다. <br> 목넘김도 경쾌하고, 불순물은 적고 시원한 맛입니다. <br> 식사와 함께하기에도 최적의 안정된 순조주입니다.",
"다이긴죠(大吟醸)급의 화려한 향과 풍부한 향이 특징이며, 입안에 퍼지는 맛과 그 뒤의 끝맛도 뛰어납니다! <br> 적당한 산미와 상쾌한 과일향이 즐길 수 있는 맛입니다.",
"온화하고 맑고 세련된 향으로 상쾌합니다. <br> 맛은 불순물이 없는 깨끗하고 투명한 맛으로, 바로 옅은 맑고 맵직한 맛입니다. <br> 그 속에는 약간의 쌀 맛과 연해진 단맛 및 산미도 느껴집니다.",
"여름 수박을 연상시키는 상큼하고 청량한 향이 떠오르고, 그 깊은 곳에 있는 살비아나 분꽃의 향이 그리움을 자아냅니다. <br> 촉촉하고 감각적인 요소가 입 안 가운데에 모여 맛의 윤곽을 잡습니다. <br> 점착성을 가진 세련된 바디이지만, 살짝 자극적인 맛으로 입맛을 유혹하고 가벼운 여운으로 이어줍니다.",
"멜론이나 배와 같은 부드러운 긴조 향이 느껴지며, 새주(新酒)답게 신선하고 순수한 맛을 느낄 수 있습니다. <br> 입맛은 높은 산미가 느껴지며, 후미의 끝맛이 날카롭습니다. <br> 새주(新酒) 고유의 거칠고 힘찬 특징과 풍부한 풍미 속에 느껴지는 촉촉함을 즐기실 수 있습니다.",
"가을 한정의 순미긴조주입니다. <br> 미죠부를 대표하는 '타마 라벨'을 모티브로, 개성 있는 고양이와 보름달을 이미지화한 라벨입니다. <br> 봄과 여름 사이에 저온 보관으로 천천히 숙성시켜 더욱 풍부한 쌀의 맛과 부드러운 산미가 깊은 맛을 낼 수 있습니다.",
"미세하고, 여운에 풍미가 퍼지며 세련된 맛이 특징입니다. <br> 질리지 않고 즐길 수 있는 '긴조주'입니다. <br> 은은한 긴조 향이 있으며, 입맛은 가벼우면서 부드럽고, 마시기 좋으며, 풍미가 풍성하게 퍼지는 우아한 맛으로 마무리되어 있습니다. <br> 또한, 상온이나 약간 따뜻한 온도에서도 즐길 수 있습니다. <br> 마실수록 끝까지 변함없는 맛을 즐길 수 있어 이시모토주조의 자랑스러운 주류입니다.",
"산은 움직이지 않고, 강은 흐르는 것'을 의미하는 말로, 모든 것에 고집하는 생각에 사로잡히지 않고자 하는 마음으로 명명되었습니다. <br> '키사라기'는 '가산류' 시리즈의 원점을 의미합니다. <br> 가벼우면서 부드러운 맛과 향의 절묘한 균형. <br> 쌀은 자사 밭에서 재배한 '데와산산'을 사용하며, 야마가타 현산에 고집한 궁극의 한정품입니다.",
"단순한 원주와는 달리, 물을 첨가하여 술의 질을 조절하고, 반년간 저장 숙성시킨 '최종 형태'의 술입니다. <br> 과일향이 풍부하고 화려한 향과 부드러운 맛은 청량감을 줍니다. <br> 니가타의 지역 술로서 담백한 표정을 보이지만, 순수한 맛을 강조하고 저장 숙성을 통해 부드럽게 포장한 것이 특징입니다. <br> 검은 유리 병에 담겨 전용 나무 상자로 전달되어 선물로도 좋습니다. <br> 니이가타 현지에서 표창받은 신보히로아키 주조의 기술을 담은 제품으로, 니이가타의 술을 충분히 즐길 수 있는 특별한 술입니다.",
"우아한 긴죠의 향과 섬세한 맛입니다. <br> 쌀의 달콤함을 느낄 수 있습니다. <br> 화려하고 과일향이 특징적입니다. <br> 꼬리표인 「くどき上手」은 전국에 많은 팬을 지닌 명주입니다. <br> ※ 「くどき上手」라는 술 이름은, 전쟁 시대를 살아남아 큰 세력을 갖춘 무신으로 거듭난 인물에서 영감을 받았습니다.",
"양조사들이 정성을 다하여 양조한 다이긴죠의 술 중에서 높은 기준을 충족한 것만이 유키만만이라는 이름을 사용할 수 있습니다. <br> 이 대길고중을 저온에서 천천히 숙성시켜 고급술 특유의 과일향을 남기면서 각을 제거하여 부드러운 맛을 띄게 됩니다. <br> 데와사쿠라가 이루어내는 '아름다운 숙성'을 경험해 보세요.",
"전국 평가회에 출품되는 술과 동등한 품질의 다이긴죠를 원액 그대로 병에 담아내었습니다. <br> 이 제품은 매년 11월 한 번 한정으로 출시됩니다. <br> 최상급의 고급스러운 향과 풍부한 쌀 맛이 완벽하게 조화된 최상급 품입니다. <br> 고상하고 우아한 향과 부드럽고 풍부한 맛을 즐기실 수 있습니다. <br> 전용 소나무 상자에 포장되어 있어 외관도 화려하며 선물용으로도 최적입니다.",
"5년 연속으로 전국 신주 평가회에서 금상을 받았습니다. <br> 특A급 야마다니시와 함께 센본진을 중심으로 40%까지 제품을 정제한 후, 세토나이칠리해국립공원 노로산의 지하수로 정성스럽게 양조되었습니다. <br> 이 술은 병 안으로 옮겨 데워서 한 번만 가열살균을 거친 후, 2도의 냉장고에서 약간의 숙성을 거쳤습니다. <br> 센본진의 우아하고 부드러운 맛과 함께 야마다니시의 특유한 구조도 느낄 수 있으며, 대길고 특유의 화려한 향이 입안을 가득 채웁니다. <br> 이 술은 충분히 차게 해서 즐기실 수 있습니다.",
"하얀 복숭아와 바나나에 시트러스 및 플로럴한 뉴언스가 더해진 아로마를 가진, 우아하고 화려한 향이 특징인 술입니다. <br> 온화한 단맛과 함께 즐거운 산미가 술의 전체적인 맛을 유도하며, 시작부터 끝까지 완벽하게 윤곽이 잡힌 부드럽고 부드러운 질감이 인상적입니다. <br> 투명함과 깔끔함이 느껴지는 쌀의 맛이 매우 아름답고, 오래 지속되는 후미에 남습니다.",
"지향하는 것은 궁극적인 간과 청명함입니다. <br> 이세시마 정상회담에서도 제공되어 현재는 세계의 주류가 되었습니다. <br> 우치야마 토시히로가 술 양조에 바친 열정과 가지는 힘을 아끼지 않고 쏟아부은 정성의 작품입니다. <br> 호화로운 원료를 아낌없이 사용하고, 양조에 필요한 모든 단계에서 시간과 노력을 아끼지 않고 한 방울 한 방울, 세심하게 양조한 저희의 최고 품질의 술입니다. <br> 이 작품 라인업의 정상을 차지하는 이 술은 '사쿠'라는 이름을 갖게 되었으며, 주류에게 '타케가네'라는 명성을 부여했습니다. <br> 어디까지나 깊고 풍부한 향과 우아한 최고의 맛을 마음껏 즐겨보세요.",
"저온에서 세심하게 양조하여 고品질의 제품을 만들어냄으로써, 입에 넣으면 화려한 향과 과일 맛이 동시에 펼쳐지며, 그리고 상쾌하고 투명한 맛과 함께 가벼운 후맛이 부드럽게 이어집니다. <br> 이 술은 주조사의 열정과 자유로운 상상력이 만들어낸 '우라·가산류' 시리즈 중에서도 비용 대비 성능이 뛰어나며, 한 번 맛볼만한 가치가 있는 제품입니다.",
"상쾌한 향과 부드러운 산미가 부드럽게 목을 감싸줍니다. <br> 이 아름다운 산미와 깊은 맛의 균형이 정말 좋습니다.",
"「千代の光 本醸造」는 천대의 빛의 기원으로, 술 양조의 모든 것이 담긴 술입니다. <br> 스탠다드하지만 일종의 긴조술이라고 할 수 있는 정도로, 정미보합 60% 이하의 원료를 사용하여 쌀 본연의 맛을 살린 술입니다.",
"'五百万石'을 사용하여 시스이의 품질 좋은 지하수로 양조된 본 양조의 새로운 술입니다. <br> 처음 짜낸 것처럼 상쾌하고 젊은 향과, 단단하고 깔끔한 맛이 특징입니다.",
"'히다호마레'는 고품질의 지하수를 사용하여 외부 쌀로 만들어진 술로, 쌀의 단맛과 풍미를 느낄 수 있습니다. <br> 농부들의 마음이 가득한 이 술은 품질이 낮은 쌀을 사용하지만 순 증류주로 출시되어 많은 이들이 기다리는 인기 상품입니다.",
"兵庫県에서 생산된 최고급 술용 쌀인 '야마다네'를 사용하여 자사에서 가공한 이 술은 대급주 등에 사용되는 고품질 쌀을 사용합니다. <br> 백 라벨에는 다음과 같이 써 있습니다. <br> '나부라'는 바다에서 소란을 일으키는 물고기 떼의 물보라를 가리키며, 신선한 해산물을 대담하게 즐기는 요리를 '나부라 요리'라고 합니다. <br> 최상의 재료를 사치스럽게 사용하면서도 과하지 않고 즐기는 '나부라 요리'가 바다의 은혜라면, 미수 '나부라'는 산의 은혜입니다. ",
"요리를 방해하지 않으면서도 부드럽고 신선한 맛을 느낄 수 있는 고품질의 보통 술입니다. <br> 원료 쌀로는 미야마키의 일등쌀을 사용하며, 정미보행은 60%로 맑고 깔끔한 맛으로 음식과 잘 어울립니다. <br> 냉장에서부터 온주까지 어느 온도에서도 즐길 수 있습니다. <br> 1984년에 탄생한 생일포는 세련된 은총의 향과 부드러운 맛으로 즐거움을 더합니다.",
"'不老泉'은 네 번의 술 효모 추가로 만들어진 특별한 술로, 풍성한 맛을 선사합니다. <br> 이 과정은 현재는 드물지만, 술을 더 깊고 풍부하게 만드는 방법 중 하나입니다. <br> 산과 아미노산의 수치가 높아 풍부한 맛을 느낄 수 있으며, 상쾌하고 부드러운 느낌이 특징입니다."];

let sakePic = ["./../img/Sake/jyunmai/bansyuikkon.png", "./../img/Sake/jyunmai/soku.png", "./../img/Sake/jyunmai/akabu.png", "./../img/Sake/jyunmai/kamaitachi.png",
"./../img/Sake/jyunmai/sitida.png", "./../img/Sake/jyunmai/konaki.png", "./../img/Sake/jyunmai/kamenoumi.png",
"./../img/Sake/jyunmai/W.png", "./../img/Sake/ginjyo/bakuren.png", "./../img/Sake/ginjyo/dewasakura.png",
"./../img/Sake/ginjyo/izumo.png", "./../img/Sake/ginjyo/kubota.png", "./../img/Sake/ginjyo/kokuryu.png",
"./../img/Sake/ginjyo/kikuhime.png", "./../img/Sake/ginjyo/bizyohu.png", "./../img/Sake/ginjyo/kosinokannbai.png",
"./../img/Sake/daiginjyo/gasan.png", "./../img/Sake/daiginjyo/bokusi.png", "./../img/Sake/daiginjyo/kudoki.png",
"./../img/Sake/daiginjyo/yukimanman.png", "./../img/Sake/daiginjyo/kosinokagetora.png", "./../img/Sake/daiginjyo/ugonotuki.png",
"./../img/Sake/daiginjyo/masumi.png", "./../img/Sake/daiginjyo/zaku.png", "./../img/Sake/honjyozo/uragasan.png",
"./../img/Sake/honjyozo/wakanami.png", "./../img/Sake/honjyozo/chiyo.png", "./../img/Sake/honjyozo/kinoene.png",
"./../img/Sake/honjyozo/horai.png", "./../img/Sake/honjyozo/nabura.png", "./../img/Sake/honjyozo/yoakemae.png",
"./../img/Sake/honjyozo/bullo.png"];


let fruitwineName = ["天狗舞 梅酒 1800ml (텐구마이 매실주)", "黒糖梅酒 1800ml (흑설탕 매실주)", "鳳凰美田 いちご酒 500ml (호오비덴 딸기주)", "鶴梅 柚子 1800ml (츠루우메 유자)", "百年梅酒ウイスキー樽熟成 720ml(백년매실주 위스키통 숙성)",
    "天吹 アポロン ブラッドオレンジ梅酒 1800ml (아마부키 아폴론 블러드오렌지 매실주)", "すてきな マンゴー酒 1800ml(멋진 망고주)", "唐草まっこり 1800ml(카라쿠사 막걸리)", "黒牛梅酒(くろうしうめしゅ) 1800ml (흑우 매실주)", "すてきな みかん酒 1800ml (멋진 귤주)"];

let fruitwineJujosa = ["쿠루마타 주조 車多酒造", "마하라 주조 麻原酒造", "코바야시 주조 小林酒造" , "헤이와 주조 平和酒造", "메이리주류 明利酒類", "아마부키주조 天吹酒造", "아사와라주조 麻原酒造", "하마지주조 浜地酒造", "나카다식품 中田食品", "아사와라주조 麻原酒造"];
let fruitwineJujoArea = ["이시카와현 石川県", "사이타마현 埼玉県", "토치기현 栃木県", "와카야마현 和歌山県", "이바라키현 茨城県", "사가현 佐賀県", "사이타마현 埼玉県", "후쿠오카현 福岡県", "와카야마현 和歌山県", "사이타마현 埼玉県"];
let fruitwineDosu = ["16", "14", "5~6", "7", "18", "9", "7", "8 ~ 9", "13", "7"];


let fruitwinePrice = ["38,000", "48,000", "33,000", "44,000", "60,000", "50,000", "40,000", "40,000", "52,000", "40,000"];

let fruitwineDescript = ["『紀州 南高梅』매실을 호화롭게 사용하여, 설탕의 1.5배의 달콤함을 갖는 과당을 사용하고, 추가하는 재료를 크게 줄인 건조한 맛의 타입. <br> 칼로리를 걱정하는 분들에게도 추천합니다. <br> 텐구마이 다이긴죠를 만든 '자가 제조한 본격적인 소주'를 블렌딩하여, 플러스 알파의 향미도 즐겨보세요.",
                    "선별된 매실과 국내산 흑설탕을 사용한 매실주입니다. <br> 얼음 설탕 등으로 단맛을 조절한 매실주와는 다르게, 흑설탕 특유의 우아하고 깊은 풍미를 느낄 수 있습니다. <br> 매실 향이 높고, 브랜디를 연상시키는 향긋한 맛과 진한 달콤함에 매실의 산미가 좋은 강조를 더하며, 후각에서의 달콤함은 깔끔합니다. <br> 물을 타서 마시는 것을 추천합니다. ",
                    "보는 순간 진한 맛을 상상할 수 있습니다. <br> '토치오토메'라는 브랜드 딸기, 토치기의 명품을 사용합니다. <br> 호오비덴의 술을 베이스로, 풍성한 딸기를 사용하여 만든 매우 호화로운 제품입니다. <br> 마개를 열자마자 달콤한 딸기 향이 풍겨옵니다. 입안에서는 매우 부드럽고 진밀합니다. 진한 딸기 달콤함과 사랑스러운 산미가 입안을 가득 채웁니다. <br> 딸기 특유의 알알한 과육감까지 완벽하게 재현됩니다. <br> 삼킨 후에도 풍부하고 긴 여운이 여유롭게 퍼져, 최고급의 마시는 감각을 선사합니다. <br> 진밀한 질감이 아찔하게 매혹적인 호화로운 디저트 주입니다. <br> 우유와 섞어 딸기 밀크 주로 마셔도 맛있게 즐길 수 있습니다. <br> 매년 입고 후 바로 매진되는 인기로 보아도 맛에 대해 납득할 것입니다. <br> 겨울에만 즐길 수 있는 최고급 리큐어를 즐겨보세요.",
                    "올해 수확한 신선한 유자로 만든 유자주입니다. 핑크빛이 사랑스럽고 진한 맛이 상상됩니다. '토치오토메'는 일본의 명품으로, 주변에 산과 계곡이 있어 아침과 저녁의 서늘한 기온이 엄격하고 물이 풍부하여 양조에 적합한 환경에 있습니다. <br> 헤이와 샤조의 매실주 양조는 헤이세이 7년에 시작되었습니다. 그리고 새로운 제품인 '츠루우메'가 등장했습니다.",
                    "2022년에 매실주 제조 70주년을 맞이했습니다. <br> 이와 같은 해에 위스키 사업을 시작한 계기로 '백년 매실주'를 위스키 통에서 숙성시켰습니다. 오랜 친분이 있는 치추 증류소로부터 치추에서 숙성된 위스키 통을 빌려와 숙성시켰습니다. 마지막으로 선별된 몰트 위스키의 원액을 첨가하여 위스키 통에서 유래된 바닐라 향과 복잡하고 풍부한 단맛을 표현했습니다. <br> 매실주와 위스키 통이 가지는 잠재력을 탐구한 강한 열정에서 탄생한 제품입니다.",
                    "햇살 가득한 햇볕 아래에서 잘 익은 블러드 오렌지와 꽃 효모의 일본주가 만나, 라틴한 맛의 과일 매실주가 탄생했습니다. <br> 블러드 오렌지의 풍부한 과일 맛, 진한 달콤함과 새콤함, 그리고 쓴맛이 매우 좋은 밸런스로 상쾌함도 느껴지며 잔잔하게 한 모금 또 한 모금 마시고 싶어집니다. <br> 아름다운 진홍빛의 빛나는 모습. 진한 과일 맛과 씁쓸함을 즐기는, 드문 국산 블러드 오렌지주입니다. <br><br> 술장에서 추천하는 마시는 방법 <br> 본품 1: 탄산수 1 <br> 본품 1: 요거트 1",
                    "잔에 따르자마자 망고 향이 향긋하게 퍼져옵니다. <br> 실제로 입에 넣어보면 적당한 단맛 뒤에 뒷맛이 깔끔하고 가벼운 맛으로 마무리됩니다. <br> 선호에 따라 냉장하여 순수하게, 록 또는 소다로 혼합하여 즐기실 수 있습니다.",
                    "요구르트 같은 향, 부드럽고 쌀의 부드러운 단맛을 느낄 수 있습니다. <br> 달콤 쌉쌀한 산미가 상쾌한 마시는 맛입니다. <br> 본토 한국의 막걸리만큼 걸쭉함은 강하지 않지만, 끝맛이 시원하고 마시기 쉬운 '일본식 막걸리'입니다! <br> 고기 요리나 꼬치와도 완벽한 조화를 이룹니다.",
                    "부드럽고 풍성한, 일본주 베이스의 매실주 특유의 미묘한 향미와 산미의 균형이 훌륭한 우마쿠치 타입의 매실주입니다. <br> 특히, 온더록에서 최적의 부드러움, 엑기스, 단맛에 중점을 두고 제작되었습니다.",
                    "온천 오렌지를 100% 사용하고 있습니다. <br> 온천 오렌지의 부드럽고 상쾌한 향과, 단맛뿐만 아니라 적당한 산미가 상쾌한 뒷맛을 남겨줍니다. <br> 선호에 따라 냉장하여 순수하게, 록 또는 소다로 혼합하여 즐기실 수 있습니다."
                ];

let fruitwinePic = ["./../img/fruitwine/tengu.png", "./../img/fruitwine/blacksugar.png", "./../img/fruitwine/strawberry.png", "./../img/fruitwine/yuza.png",
    "./../img/fruitwine/100year.png", "./../img/fruitwine/amabuki.png", "./../img/fruitwine/mango.png",
    "./../img/fruitwine/karakusa.png", "./../img/fruitwine/blackcow.png", "./../img/fruitwine/mikang.png",];

let beerName = ["アサヒスーパードライ350ml (아사히 슈퍼드라이) X 24", "アサヒスーパードライ ドライクリスタル 350ml (아사히 슈퍼드라이 크리스탈) X 24", "アサヒ生ビール 350ml (아사히 생맥주) X 24", "アサヒ食彩 350ml (아사히 쇼쿠사이) X 24", "アサヒオリオン ザ・ドラフト 350ml (아사히 오리온 더 드래프트) X 24",
"アサヒ オリオン 75BEER ホワイトエール 350ml (아사히 오리온 75비어 화이트 에일) X", "ザ・プレミアム・モルツ 350ml缶 (더 프리미엄 몰츠) X 24", "アイスドラフト〈生〉350ml缶 (아이스 드래프트) X 24", "金麦 350ml缶 (킨무기) X 24", "サントリー生ビール 350ml缶 (산토리 생맥주) X 24", "パーフェクトサントリービール 350ml缶(퍼펙트 산토리 맥주) X 24", 
"東京クラフト〈ペールエール〉350ml缶 (도쿄 크래프트 <페일에일>) X 24", "セブンプレミアム ザ・ブリュー 350ml缶 (세븐프리미엄 브루) X 24", "KIRIN 一番搾り350ml (기린 이치방시보리) X 24", "キリン のどごし<生> 350ml (기린 노도코시) X 24", "キリンラガービール 350ml (기린 라거맥주) X 24", "キリンビール 晴れ風 350ml (기린 맥주 하레카제) X 24",
"本麒麟 350ml (혼키린) X 24"];

let beerJujosa = ["아사히 アサヒ", "아사히 アサヒ", "아사히 アサヒ", "아사히 アサヒ", "아사히 アサヒ", "아사히 アサヒ", "산토리 suntory", "산토리 suntory", "산토리 suntory", "산토리 suntory", "산토리 suntory", "산토리 suntory", "산토리 suntory", "기린 KIRIN", "기린 KIRIN", "기린 KIRIN", "기린 KIRIN", "기린 KIRIN"];

let beerDosu = ["5", "3.5", "4.5", "5.5", "5", "5", "5.5", "6", "5", "5", "5.5", "5", "5", "5", "5", "5", "5", "6"];

let beerPrice = ["43,000", "49,000", "40,300", "60,000", "40,000", "50,000", "53,000", "71,300", "70,000", "56,000", "80,000", "70,000",
"50,000", "60,000", "100,000", "70,000", "38,000", "48,000", "51,000", "61,000", "60,000", "44,000", "58,000", "51,000", "38,000", "48,000",
"58,000", "40,000", "50,000", "70,000", "40,000", "38,000"];

let beerDescript = ["마시는 순간 순식간에 느껴지는 깔끔함이 특징인 맥주입니다.",
                "새로운 맥주의 흐름. 새로운 맛을 제안하는, 풍부함과 투명감 있는 끝맛이 특징인 슈퍼 드라이입니다.",
                "오랜 시간 동안 사람들에게 사랑받아온 부드러운 맛의 생맥주입니다. <br> 오랜 기간 사용된 제조 방법인 '부드러운 양조법'을 통해 세심하게 만들어진 '아사히 생맥주 (일반적으로 말 에프)'는 부드러운 입맛, 부드러운 맛, 적당한 쓴맛이 특징입니다. <br> 1986년 출시 이래, 음식점에서 팬들에게 사랑받아온 맛을 캔 맥주로 제공합니다. <br> 집에서 보내는 평화로운 시간이 더 행복해지는 맥주입니다.",
                "뚜껑을 열 때 피어오르는 화려한 향기와 일렁이는 아름다운 거품. <br> 그리고 느껴지는 진한 풍미와 맑은 끝맛. <br> 마치 샴페인으로 건배하는 것처럼 설레는 순간을 연출하며 식사에 화려함을 더하는, 생 맥주 잔 캔의 프리미엄 맥주입니다.",
                "오키나와에서 태어난 맥주이기 때문에 오키나와의 '맛있음'을 형상화했습니다. <br> 오늘도 하루를 열심히 보낸 나를 칭찬하고, 어깨의 힘을 느긋하게 풀며 자연스럽게 즐기는 맥주입니다. <br> '오키나와 현산 보리'를 사용하여 '얀바루의 물'로 제조된 오키나와의 맥주입니다. <br> 불필요한 잡맛을 제거하는 '신·여과 제조법'에 의해 더욱 깔끔하고 쉽게 마실 수 있게 되었습니다.",
                "오키나와 현산 밀을 사용한 화이트 에일. <br> 오키나와 현산 밀을 사용하여 밀 유래의 부드러운 맛과 오렌지 껍질로 인한 상쾌함도 느껴지는 질리지 않는 한 잔입니다.",
                "양조를 거듭하며 세부 조건을 세밀하게 조정하고 제조 방법을 추구함으로써, 풍부한 향과 깊은 맛을 갖춘 프리미엄 맥주입니다. <br> 이를 통해 마시고 나서도 즐거운 뒷맛과 더 높은 품질의 여운을 느낄 수 있도록 마무리했습니다.",
                "더운 여름에 딱 맞는 얼음을 넣어 맛있게 즐길 수 있는 맥주입니다. <br> 맥주 특유의 맛있는 느낌이 있으면서도 마시기 쉽고, 얼음이 녹아도 끝까지 상쾌함을 즐길 수 있는 맥주입니다.",
                "맑고 깔끔한 뒷맛을 그대로 유지하면서도 양조 조건을 재검토하여 보다 보리의 맛을 느낄 수 있는 맛으로 개선되었습니다",
                "'꽤 탄탄한 맛'과 '마시기 쉬움'이 특징인 생맥주입니다.",
                "'프리미엄 몰츠'와 '마스터스 드림'을 통해 축적된 제조법과 노하우를 모아 실현한, 본격적인 맥주의 맛의 당류 제로. <br> 고급스러우면서도 깊은 풍미가 특징인 다이아몬드 맥아를 일부 사용하여 사치롭게 양조한 후, 당류가 제로가 될 때까지 효모의 힘으로 천천히 발효시켜 맛을 만들어내는 독자적인 기술을 5년의 세월을 거쳐 개발했습니다. <br> 알코올 함량 5.5%의 본격적인 맥주만의 '힘있는 맛'과 '당류 제로'로 인한 상쾌한 후맛을 즐길 수 있습니다.",
                "언제나의 맥주와는 조금 다른, 상쾌한 향과 즐거운 여운이 특징인 페일 에일입니다. <br> 2023년의 리뉴얼에서는 원료 조합을 재고하여, 마운틴티어 바리어 호프 일부 사용에 의한 감귤류 특유의 상쾌한 향을 더욱 즐길 수 있는 맛으로 마무리했습니다. <br> '산토리 <천연수 맥주 공장> 도쿄 무사시노'에서만 제조되고 있습니다.",
                "엄선해서 고른 보리 맥아를 사용하여 단단한 '보리의 풍미'와 '맛있는 마신 느낌'이 특징인 정통 스타일의 새로운 장르입니다.",
                "보리의 본연의 풍미를 느낄 수 있는, 조화롭고 마시기 쉬운 맛입니다.",
                "톱 레벨의 마시기 편한 맛으로, 한 모금씩 깔끔하게 즐길 수 있는 상쾌함이 더욱 진화했습니다.",
                "호프의 향과 톡 쏘는 맛, 그리고 단단한 여운이 결합된, 끝없이 즐길 수 있는 맛의 진수입니다.",
                "바리에이션과 풍부한 호프 아로마를 느낄 수 있는 순수한 맥주의 풍미와 함께, 입에 가볍고 깨끗한 맛을 느낄 수 있습니다.",
                "'강렬한 풍미와 입안에서의 뚝심을 유지하면서도 한 입 더 마시고 싶은 그 끝이 보이지 않는 맛'을 개선하여 더욱 완성도 높은 맛을 선보입니다."];

let beerPic = ["./../img/Beer/Asahi/super1.png", "./../img/Beer/Asahi/crystal1.png", "./../img/Beer/Asahi/nama1.png", "./../img/Beer/Asahi/shyokusai1.png",
"./../img/Beer/Asahi/draft1.png", "./../img/Beer/Asahi/whiteale1.png", "./../img/Beer/Suntory/premium1.png", "./../img/Beer/Suntory/draft1.png",
"./../img/Beer/Suntory/kinmugi1.png", "./../img/Beer/Suntory/nama1.png", "./../img/Beer/Suntory/perfect1.png", "./../img/Beer/Suntory/tokyo1.png",
"./../img/Beer/Suntory/brew1.png", "./../img/Beer/Kirin/ichiban1.png", "./../img/Beer/Kirin/nodokosi1.png", "./../img/Beer/Kirin/laga1.png", 
"./../img/Beer/Kirin/harekaze1.png" , "./../img/Beer/Kirin/honkirin1.png"
];


let sojuName = ["くじらの黒麦 1800ml (고래의 흑보리)", "天の刻印 1800ml (하늘의 각인)", "おこげ 1800ml  (오코게)", "無一物 1800ml (무이치부츠 / 무소유)", "村正 1800ml (무라마사)", "丸山 1800ml (마루야마)",
"黒さそり 1800ml (쿠로사소리)", "夢想仙楽 720ml (몽상선락 / 무소센라쿠)", "悪魔の抱擁 1800ml (악마의 포옹 / 아쿠마노호요)", "やきいも黒瀬 1800ml(야키이모쿠로세)", "侍士の門 1800ml (사무라이의 문 / 사무라이노몬)", "坐忘1800ml (자보)",
"俘 1800ml (토리코)", "太久保 RED CASK レッドカスク 1800ml (오쿠보 레드캐스크)", "甕雫 1800ml (카메시즈쿠)", "むかしむかし 古酒 1800ml (무카시무카시 고주)", "八海山 よろしく千萬あるべし 1800ml (하카이산 잘 부탁한다)",
"野うさぎの走り 米焼酎37° 600ml (토끼의 질주)", "耶馬美人 米焼酎25° 1800ml (야바비진)", "有機米焼酎 豊永蔵(とよながくら) 1800ml (토요나가쿠라)", "あさぎりの花 1800ml (아사기리꽃)", "天誅 1800ml (천벌/텐츄)", "天吹 1800ml (아마부키)", "鳥飼 720ml (토리카이)",
"直火請福 1800ml (직화세이후쿠)", "残波 1800ml 白(잔파 백)", "やまかわ 1800ml (야마카와)", "まさひろ 1800ml (마사히로)", "昔醸 翠古(すいこ) 1800ml (무카시즈쿠리 스이코)", "春雨カリー1800ml (하루사메카리)",
"琉球泡盛 太郎(たろう) 720ml (타로)", "瑞泉(ずいせん) 青龍 3年古酒 720ml (즈이센 청룡)"];

let sojuJujosa = ["대해주조 大海酒造", "사토소주제조장 佐藤焼酎製造場", "카네마츠주조 老松酒造", "이키노쿠라주조 壱岐の蔵酒造", "이키노쿠라주조 壱岐の蔵酒造", "치쿠마니시키 千曲錦酒造", "사츠마무쇼우 さつま無双", "히카리주조 光酒造", "사츠마무쇼우 さつま無双",
                "가고시마주조 鹿児島酒造", "타쿠보주조 太久保酒造", "사츠마무쇼우 さつま無双", "사가라주조 相良酒造", "오쿠보주조 太久保酒造", "쿄우야주조 京屋酒造", "마루니시주조 丸西酒造",
                "하카이 주조 八海醸造", "쿠로키본점 黒木本店", "하카이 주조 八海醸造", "토요나가주조 豊永酒造", "타카다주조 高田酒造場", "시라타마주조 白玉醸造", "아마부키주조 天吹酒造", "토리카이주조 鳥飼酒造",
                "세이후쿠 주조 請福酒造", "히가주조 比嘉酒造", "야마카와주조 山川酒造", "마사히로주조まさひろ酒造", "츄코주조 忠考酒造", "미야사토주조소 宮里酒造所", "이케마주조 池間酒造", "즈이센주조 瑞泉酒造"

];

let sojuJujoArea = ["가고시마현 鹿児島県", "미야자기현 宮崎県", "오이타 현 大分県", "나가사키현 長崎県", "나가사키현 長崎県", "나가노현 長野県", "가고시마현 鹿児島県", "후쿠오카현 福岡県", "가고시마현 鹿児島県",
                "가고시마현 鹿児島県",  "가고시마현  鹿児島県", "가고시마현   鹿児島県", "가고시마현 鹿児島県", "가고시마현 鹿児島県", "미야자키현 宮崎県", "가고시마현 鹿児島県",
                "니가타현 新潟県", "미야기현 宮崎県", "오이타현 大分県", "구마모토현 熊本県", "구마모토현 熊本県", "가고시마현 鹿児島県", "사가현 佐賀県", "구마모토현 熊本県",
                "오키나와 현 沖縄県", "오키나와 현 沖縄県", "오키나와현 沖縄県", "오키나와현 沖縄県", "오키나와현 沖縄県", "오키나와현 沖縄県", "오키나와현 沖縄県", "오키나와현 沖縄県"

];

let sojuDosu = ["25", "25", "25", "25", "25", "25", "25", "40", "25", "25", "25", "30", "25", "25", "40", "25", "25", "37", "25", "25", "25", "25", "25", "25", "30", "30", "30", "30", "30", "30", "25", "30"];

let sojuPrice = ["43,000", "49,000", "40,300", "60,000", "40,000", "50,000", "53,000", "71,300", "70,000", "56,000", "80,000", "70,000",
"50,000", "60,000", "100,000", "70,000", "38,000", "48,000", "51,000", "61,000", "60,000", "44,000", "58,000", "51,000", "38,000", "48,000",
"58,000", "40,000", "50,000", "70,000", "40,000", "38,000"];

let sojuDescript = ["*흑굴을 사용하여 1차와 2차 발효를 모두 귀중한 항아리에서 정성스럽게 진행하고, 그 소주를 항아리에서 3년간 천천히 숙성시킵니다. <br> 뚜껑을 열면 고구마 향이 숙성에 의해 차분하고 우아한 향으로 변합니다. <br> 부드럽고 입안에서 살살 녹는 맛이 특징이며, 먹을수록 섬세하고 심층적인 맛을 느낄 수 있습니다. <br> *흑굴 : 일본의 전통적인 발효 공정 중 하나로, 쌀과 *쿠지를 발효시키는 과정에서 사용되는 발효 제물 <br><br> *쿠지 : 일본의 전통적인 술인 사케와 쇼쿠호를 만들 때 사용되는 발효 제물 중 하나",
                "보리의 풍미를 살려서 맑고 깔끔한 맛으로 마무리됩니다. <br> 부드럽고 상큼한 보리 향과 부드러운 입맛이 특징입니다. <br> 상쾌하고 고상한 맛이므로 마시다 지루하지 않을 것입니다. <br> 보리 소주의 초심자들에게 강력히 추천하는 한 병입니다.",
                "전통적인 흑초를 사용하여 보리의 풍미를 살립니다. <br> 특별한 보리와 와일드한 맛을 내는 쌀보리를 사용합니다. <br> 보리 초콜릿이나 보리차와 같은 향이 풍부하며, 부드러운 입맛을 가지고 있지만, 이후에는 씁쓸한 보리 향과 맛이 입안을 가득 채웁니다.",
                "셰리통에서 5년간 숙성시킨 아름다운 호박색의 호화스러운 보리 소주입니다. <br> 뚜껑을 열면 통에서 유래된 향긋한 바닐라 향이 풍겨옵니다. <br> 장기 숙성에 의한 깊고 부드러운 맛이 매력적입니다. 얼음이나 탄산수와 함께 마시기에도 좋습니다.",
                "상쾌한 보리 맛과 맛의 경쾌함. 일본 요리와 아주 잘 어울립니다. <br><br> 라벨 내용 : 옛날엔 좋았어. 마을마다 활기가 넘쳤지. <br> 그 시대에는 명도 마사무네가 잘 어울렸어. <br> 하지만 지금 세상은 혼돈스러워. <br> 이런 시대에는 요도의 날카로움이 잘 맞겠지. <br>상압도 좋지만, 여기서는 저압증류의 왕도를 목표로 해보는 것도 좋겠어. <br>이것이 바로 무라마사토이라는 풍미와 경쾌함을 즐겨주실 수 있다면, 이를 능가하는 기쁨은 없어.",
                "독자적인 중간 감압 증류법을 사용하여 보리의 달콤한 향과 맛을 끌어내고 있습니다. <br> 일본주와 같은 황색 누룩을 사용함으로써 상쾌함도 훌륭하게 표현되어, 맛과 향이 좋아 자신도 모르게 과음하는것에 주의해야 합니다!",
                "옛 방식의 상압 증류로 흑효를 사용합니다. 이 풍미는 옛부터 보리 소주라고 불릴 만한 품위를 가지고 있습니다. <br><br> 뒷 라벨 내용 : 세상에는 흑효를 사용하여 보리 소주를 만든 바보가 있다고 합니다. <br> 검은 전갈, 그 놈이네. <br> 뭐라고요, 과거 방식의 상압 증류인가요. <br> 자세히 들어보면, 오랜 기간 숙성했다는군요. <br> 점점 더 자만심이 나네요. <br> 한모금 마셔볼까요. <br> 음~ 보리의 향을 확실히 느낄 수 있고 독특한 맛이네요. <br> 그런데도 부드럽고 끝 맛이 남아있네요. <br> 음~ 이렇게 되면 우리가 설 곳이 없어지잖아 <br> 아이고~ 곤란하네요. <br> 고구마 소주 일동에서",
                "소주애호가들을 위해 특별히 선별하여 만든 보리 소주의 원주를 셰리통에서 장기 숙성한 특약점 한정 소주입니다. <br> 셰리통에서 장기 저장함으로써 고급스러운 달콤한 향과 갈색의 깊은 맛이 조화를 이루어, <br> 지루하지 않는 세련되고 부드러운 맛으로 완성되었습니다. <br> 풍부하고 농도 있는 향이 안에서 약간의 달콤함을 느낄 수 있어 매우 균형이 잘 잡힌 보리 소주 통 숙성의 매력을 즐길 수 있는 매우 매혹적인 명품입니다. <br><br> 주조장에서 추천하는 마시는 법 : 물로 섞거나 5:5의 온수혹은 스트레이트로 마시면 더욱더 맛있게 드실 수 있습니다.",
                "오크통에서 숙성시킨 고구마 소주입니다. <br> 바닐라를 연상시키는 달콤하고 부드러운 향, 고구마의 풍부한 맛과 통에서 온 풍부한 향기와 우아한 풍미가 조화롭게 어우러져 있습니다. <br> 많은 고구마 소주 팬들을 매혹시키는 한정 출시의 통 숙성 고구마 소주입니다. <br><br> 라벨 뒷면 : 이 소주를 마시기 시작한 후, 정확히 얼마나 시간이 흘렀는지 모르겠다. <br> 그래도 맛있는 술이다. <br> 그 달콤한 유혹은 옛 파리에 대한 오마주다. <br> 여성적인 이미지는 나를 유혹하는 세이렌. <br> 마치 어떤 의문의 존재에 안겨 있는 것 같은 감각적인 환상에 감싸여, 나는 영혼까지...",
                "맛과 향 모두 풍부하고 적당한 단맛과 좋은 후각이 특징인 부드러운 향이 있는 소주입니다. <br> 구워진 고구마의 특징인 고소함을 부드럽게 느낄 수 있는 소주입니다.",
                "메이지 시대까지 재배되었지만 이후 생산이 중단되었던 드문 잡곡인 '하양곡'을 사용하고 있습니다. <br> 이것은 소량만 수확되며 매우 비싸다고 알려져 있습니다. <br> 또한, 고구마도도 현재의 고구마의 뿌리라고 알려진 '겐지고구마'를 사용하고 있습니다. <br> 이러한 원료들을 옛 방식으로 묵에서 발효시켰습니다. <br> 부드럽고 깊은 감자 향이 느껴집니다. <br> 부드러운 입맛에서 그 후 진한 단맛과 풍미가 퍼집니다. <br> 고상한 여운이 느껴진 후에는 시원하게 마무리됩니다.",
                "감자의 풍미를 최대한으로 살리기 위해 거친 여과 및 30도의 알코올 함량으로 제조되었습니다. <br> 알코올 함량이 30도로 다소 높지만, 감자의 단맛이 잘 느껴집니다. <br> 진한 감자의 맛과 특유의 풍부한 풍미가 조화롭게 어우러진 맛입니다. <br><br> 라벨 내용 : 소주를 마시며 잠시 동안 시간을 잊고, 나 자신을 잊고 혼자서 만취한 상태로 마음을 놀게 합니다.",
                "조화로운 세련미와 상쾌한 맛이 천천히 사라지며 세 가지 단계로 변화하는 놀라운 맛입니다. 당사에서도 인기가 높은 제품입니다. <br><br> 라벨 내용 : 인간은 오래 살다보면 어쩔 수 없이 갇히게 되는 것을 만나게 됩니다. <br> 예를 들어, 이러한 술도 그런 종류입니다. <br> 이것은 사가라 가의 선조로부터 전해진 입맛을 기반으로 도지가 정성을 다해 만든 것입니다. <br> 저런, 이 술에는 약해요. <br> 사로잡힐 것 같아요.",
                "향과 맛이 숙성되어 부드러워진 고령의 고구마 소주를 유럽에서 레드 와인 저장에 사용되었던 통에 더 숙성시킵니다. <br> 고령주의 풍미는 물론 레드 와인에서 나오는 산미와 달콤함도 즐길 수 있습니다. <br> 얼음 또는 탄산으로 섞어 마시는 것이 좋습니다.",
                "미야자키에서 유기농 비료를 사용하여 재배한 고구마를 일부 원료로 사용했습니다. <br> 과일향과 향기로운 특유의 상쾌한 고구마 소주입니다. <br> 약 20도까지 물을 탔기 때문에 부드럽고 쉽게 마실 수 있으며, 소주에 익숙하지 않은 분들도 즐기실 수 있습니다. <br> 매끈하고 부드러운 맛과 함께 일본 음식이나 프렌치 생선 요리에도 좋습니다. <br> 부엌 티스푼이 함께 제공되므로, 그것으로 따라서 잔에 따르고 즐겨주세요.",
                "황금 천관을 사용하고, 상형 통에서 원액을 3년 이상 숙성시켰습니다. <br> 깊은 풍미, 달콤함, 향기가 풍부한 고구마 소주입니다. <br> 천천히 숙성시켰기 때문에 풍미가 천천히 느껴지며 부드럽고 풍부한 맛의 고구마 소주로 완성되었습니다.",
                "일본의 주류 '하카이산'의 양조 기술을 채용하여, 청주효몽와 황색 누룩을 사용한 '삼단 시코미'를 진행하고 있습니다. <br> 발효 중에 청주*지게미를 첨가하여, 은은한 일본 전통주의 향기가 나는 모로미에서 저압 증류한, 저장 연수가 2년 이상인 소주입니다. <br><br> *지게미 :재강에 물을 타서 모주를 짜내고 남은 찌꺼기.",
                "본주인 긴죠 술을 모티브로한 쌀 소주입니다. <br> 오랜 시간 동안 항아리에서 숙성된 고급 술과 찹쌀 소주가 블렌딩되어, 세련되고 우아한 입맛, 상쾌한 쌀 향, 그리고 녹아드는 듯한 여운을 즐길 수 있습니다. 알코올 도수는 42%로 높지만, 술을 더 많이 마시면 더 깊은 맛을 즐길 수 있습니다. '野うさぎの走り(Nouzaki no hashiri)'는 '이상한 나라의 앨리스'에서 앨리스를 이상한 나라로 유혹하는 토끼를 상상하여 이름이 지어졌습니다. <br> 여유로운 마시는 느낌은 이상적인 상상과 딱 맞습니다.",
                "환상의 소주라고도 칭송받는 인기 있는 '야마비토'를 맛보세요. <br> 쌀 소주인 '야마비토' 25도는 원료를 엄선하고 일 년 중 가장 추운 계절에 양조됩니다. <br> 저온 발효 후 천천히 증류하여 더욱 숙성시켜 미감이 풍부한 순순한 정미본격 소주입니다. <br> 골고루 잘 정제된 부드러운 맛과 상쾌한 목넘김, 이 모든 것이 '정미본격 소주의 명품'이라 자부합니다. <br> 온수나 물로 즐기는 것은 물론이고 가능하다면 스트레이트로 맛보세요. <br> 여성분들로부터도 큰 지지를 받고 인기 있는 제품입니다. <br> 주정사의 열정적인 소주 양조에 대한 열정도 함께 느껴보시길 바랍니다.",
                "토요나가 주조에서는 엄격한 유기농 기준을 충족시키기 위해 계약 농가와 자사 농장에서 재배한 유기농 양조용 쌀을 전량 사용하고 있습니다. <br> 은은한 향과 부드러운 입맛에 상쾌한 약간의 달콤함을 느낄 수 있습니다. 풍성한 쌀 맛이 퍼지지만, 맛있게 깔끔하게 마무리됩니다. <br> 깊은 풍미도 있지만, 상쾌하고 맑은 마무리라 음식과의 조화를 더해줍니다. 굴이나 생선 요리, 찌개 요리와도 탁월한 조화를 이룹니다.",
                "라이트한 쌀의 풍미와 사랑스러운 달콤함에 자연스럽게 홀릴 것입니다. <br> 클래식한 풍미를 가진 규마 소주는 여성들이나 규마 소주를 처음 접하는 분들에게도 매우 인기가 있습니다. <br><br> ・「규마 소주」에 대하여 1995년 인요시 구마에서 만들어진 쌀을 원료로 한 소주가 공식적으로 '규마 소주'로서 본격적인 소주의 브랜드로서는 일본에 4개 밖에 없는 국세청의 '지리적 표시의 원산지 지정'을 받았습니다. <br> 좋은 품질의 쌀과 물에 대한 엄격한 주의는 규마 소주를 코냑이나 보르도 와인과 어깨를 나란히 하는 세계적인 브랜드로 끌어올렸습니다.",
                "쌀 소주가 가지고 있는 깊은 맛과 고구마 소주만의 부드러움이 조화된 풍부한 향미의 소주입니다. <br><br>・'천징(천벌)' 이름의 유래 본래 천에서 주어진 풍족한 수확인 쌀과 감자를 베이스로 한 소주로, 천부의 풍요로운 것으로 양조된 소주, 즉 '천소'였지만 돌아와 바람은 불고, 시대가 떨리는 이 업계를 둘러싸고 있는 환경 속에서, 고의로 '천징'이라고 이름을 붙였습니다.",
                "상위층 소주를 연상시키는 멜론, 화이트 복숭아, 사과 같은 풍성하고 화려한 향미. <br> 숙성으로 매끄럽고 입안에서는 깔끔한 느낌이며, 끝맛은 깔끔합니다. <br> 갓 짜낸 신선한 술 치장은 효모도 활기차며 향기로운 성분과 쌀의 추출물이 풍부하게 담겨 있습니다. <br> 그 치장을 즉시 떼어내고, 양조수를 첨가하고 탱크에 2주 정도 발효합니다. <br> 신선한 술 치장은 발효도 즉시 시작된다고 합니다. <br> 감압 증류로 화려하고 가볍고 풍미가 풍부합니다. <br> 이 소주를 항아리에 1년 이상 저장하고 몇 년 동안 저장 탱크에서 숙성시킴으로써 부드러움이 추가됩니다. <br> 재료의 좋은 점이 살아 있으므로 얼음을 넣은 상태로 마시는 것을 추천합니다.",
                "이 소주는 부드럽고 상쾌한 입안에서의 맛과 함께, 아름다운 과일향으로 부드럽게 퍼지는 것이 특징입니다. <br> 입안에서의 부드러운 향과 깔끔한 마시는 맛으로 인해 쉽게 즐길 수 있습니다. <br> 마실 때에는 록이나 물을 섞는 것이 좋습니다. <br> 이 때에는 꼭, 얼음이나 물이 칼슘 냄새가 나지 않은 것을 사용하는 것이 좋습니다. <br> 이렇게 하면 '토리카이'의 향을 충분히 즐길 수 있습니다",
                "현재는 보일러 증기를 사용한 증류가 일반적이지만, 세이후쿠주는 직화 가마 증류 방식을 사용하여 소주를 만들고 있습니다. <br> 각각의 독특한 화로를 섬세하게 조절하고, 한 방울 한 방울 소주가 태어나는 시간은 제조자로서의 빈폐한 시간입니다. <br> 풍부한 맛, 쌀의 달콤함과 고소한 향이 높이 솟는, 그것이 직화 세이후쿠입니다. <br> 선조로부터 전해진 전통 기술에 술조가 완벽히 몰두한 연구의 기술로 만들어진다. <br> 이것이 바로 직화 세이후쿠의 집착입니다. <br> 지금, 가장 뛰어난 기술로부터 탄생한 직화 세이후쿠는 향과 맛이 모두 풍성한 소주로, 정말로 소주다운 매력이 느껴지는 소주입니다.",
                "여성이나 소주에 익숙하지 않은 분들도 쉽게 마실 수 있는 소주를 만들고자 하는 컨셉으로 시행착오를 거듭하며 독자적인 증류기를 개발하고 탄생한 것이 잔파 화이트입니다. <br> 과일 향과 상쾌한 맛이 여성들에게도 높은 인기를 자랑합니다. 투명하고 특징적인 맛이 특징입니다.",
                "술의 본래 개성과 풍미를 최대한으로 살리기 위해 여과를 가볍게 제한하고 있습니다. <br> 입안에서의 부드러움과 함께 풍미도 충분히 느낄 수 있습니다. <br> 마시기 쉽고 균형 잡힌 맛, 그리고 여운까지도 길고 매우 좋은 느낌입니다.",
                "'마사히로'는 화려한 향과 깔끔한 맛으로, 마사히로주조(구회사명 주식회사 히가주조)의 역사와 함께 한 대표 브랜드입니다. <br> 선대인 '昌廣(쇼코우)'씨의 이름을 '마사히로'로 읽어서 상품화하였으며, 쇼와시대에 발매 이후 50년 이상이 지난 현재에도 변함없는 인기를 자랑합니다.",
                "이 소주는 매우 번거로운 과정 때문에 현대에선 잊혀진 전통적인 소주 제조 방법인 *シー汁浸漬法(시 지르신츄호우)을 몇 년 동안의 시간과 노력을 투여하여 부활시킨 소주입니다. <br> 달콤하고 향긋한 향, 마치 고대 술처럼 고요하고 부드러운 맛, 그리고 다른 것과 비교할 수 없을 만큼 확장되는 우아한 달콤함이 특징입니다. <br> 오래된 것과 새로운 것이 공존하는 소주 '옛날 양조 그린 예'를 꼭 한번 시도해보세요. <br> シー汁浸漬法 : 소주 제조에 사용되는 일반적인 과정과는 달리, 쌀을 씻고 삶는 대신 쌀의 푹푹 익은 물에 담가두는 방법",
                "4명의 소수 정예로 생산량보다 품질에 집중하는 양조장의 레귤러 주류입니다. <br> 만들어진 소주는 1년 이상 숙성한 후에 오일이 떠오르는 것을 경험과 감으로 정확한 양을 손수 건져내는 작업을 합니다.<br> 이 '하루사메 카리-'는 2~3년 숙성한 소주입니다. <br> 잔에 따르면 고소한 향이 퍼지고, 이후 바닐라와 같은 달콤한 향이 퍼집니다. <br> 30도의 도수가 거의 느껴지지 않을 정도로 부드럽고 깊은 진한 맛을 가지고 있습니다. <br><br> ※ '카리-(喜例)'는 오키나와 지역에서 기쁨과 좋은 기운을 나타내는 말입니다.",
                "'太郎'라는 술 이름은 사장님의 이름에서 유래되었습니다. 이 소주는 알코올 도수가 다소 낮은 25도입니다. <br> 부드러운 단맛과 풍부한 향으로, 마일드한 타입의 소주입니다. <br> 숙성된 풍미와 달콤한 맛이 가득한 부드러운 입맛으로, 경쾌한 소주의 맛을 즐기실 수 있습니다.",
                "3년 이상 숙성시킨 고급 소주입니다. 알코올 도수는 30도로, 얼음과 함께 마셔도 부드럽고, 입에 넣으면 고급 소주 특유의 풍부한 달콤함이 퍼져나갑니다."
];

let sojuPic = ["./../img/Soju/borisoju/gore.png", "./../img/Soju/borisoju/gakin.png", "./../img/Soju/borisoju/okoge.png", "./../img/Soju/borisoju/musoyu.png",
"./../img/Soju/borisoju/muramasa.png", "./../img/Soju/borisoju/maruyama.png", "./../img/Soju/borisoju/sasori.png",
"./../img/Soju/borisoju/mongsang.png", "./../img/Soju/imosoju/devil.png", "./../img/Soju/imosoju/kurose.png",
"./../img/Soju/imosoju/samurai.png", "./../img/Soju/imosoju/zabo.png", "./../img/Soju/imosoju/toriko.png",
"./../img/Soju/imosoju/okubo.png", "./../img/Soju/imosoju/kamesizuku.png", "./../img/Soju/imosoju/mukasi.png",
"./../img/Soju/ricesoju/hakaisan.png", "./../img/Soju/ricesoju/rabbit.png", "./../img/Soju/ricesoju/yababijin.png",
"./../img/Soju/ricesoju/toyonagakura.png", "./../img/Soju/ricesoju/asagiri.png", "./../img/Soju/ricesoju/tenchyu.png",
"./../img/Soju/ricesoju/amabuki.png", "./../img/Soju/ricesoju/torikai.png", "./../img/Soju/awamori/seihuku.png",
"./../img/Soju/awamori/janpa.png", "./../img/Soju/awamori/yamakawa.png", "./../img/Soju/awamori/masahiro.png",
"./../img/Soju/awamori/suiko.png", "./../img/Soju/awamori/harusame.png", "./../img/Soju/awamori/taro.png",
"./../img/Soju/awamori/zuisen.png"];


// ---------------- 상품 페이지 기본 설정 -----------------------
/*
    detail 페이지에서 받은 데이터 -> localName, localIdx를 localStorage에서 가져와
    "가격, 알콜 도수, 주조 지역, 주조사, 상세 설명, 이미지 출력
*/
function onInit(){
    // detail ... page data -> localName, localIdx Ex] 사케, 1
    let localName = localStorage.getItem("name");
    let localIdx = localStorage.getItem("idx");
    let name, price, dosu, jujoArea, jujosa, descript;

    subTitle = document.getElementById("subTitle"); // 타이틀 Ex] 사케 >
    name = document.getElementById("name"); // 상품명
    price = document.getElementById("price"); // 상품 가격
    dosu = document.getElementById("dosu"); // 술 도수
    jujoArea = document.getElementById("jujoArea"); // 술 조주 지역
    jujosa = document.getElementById("jujosa"); // 술 조주 기업
    descript = document.getElementById("descript"); // 상세 설명
    alcholImg = document.getElementsByTagName("img"); // 이미지

    // localName -> sake 일 시 데이터 출력
    if(localName === "sake"){
        subTitle.innerHTML = "사케 >";
        name.innerHTML = sakeName[localIdx];
        price.innerHTML = "가격 : " + sakePrice[localIdx] + " 원";
        dosu.innerHTML = "알콜 도수 : " + sakeDosu[localIdx] + "%";
        jujoArea.innerHTML = "주조 지역 : " + sakeJujoArea[localIdx];
        jujosa.innerHTML = "주조사 : " + sakeJujosa[localIdx];
        descript.innerHTML = "상세 설명 : " + sakeDescript[localIdx];
        alcholImg[0].src = sakePic[localIdx];
    
    //  localName -> fruitwine일 시 데이터 출력
    }else if(localName === "fruitwine"){
        subTitle.innerHTML = "과실주 >";
        name.innerHTML = fruitwineName[localIdx];
        price.innerHTML = "가격 : " + fruitwinePrice[localIdx] + " 원";
        dosu.innerHTML = "알콜 도수 : " + fruitwineDosu[localIdx] + "%";
        jujoArea.innerHTML = "주조 지역 : " + fruitwineJujoArea[localIdx];
        jujosa.innerHTML = "주조사 : " + fruitwineJujosa[localIdx];
        descript.innerHTML = "상세 설명 : " + fruitwineDescript[localIdx];
        alcholImg[0].src = fruitwinePic[localIdx];

    // localName -> beer일 시 데이터 출력
    }else if(localName === "beer"){
        subTitle.innerHTML = "맥주 >";
        name.innerHTML = beerName[localIdx];
        price.innerHTML = "가격 : " + beerPrice[localIdx] + " 원";
        dosu.innerHTML = "알콜 도수 : " + beerDosu[localIdx] + "%";
        jujoArea.remove;
        jujosa.innerHTML = "주조사 : " + beerJujosa[localIdx];
        descript.innerHTML = "상세 설명 : " + beerDescript[localIdx];
        alcholImg[0].src = beerPic[localIdx];

    // localName -> soju일 시 데이터 출력
    }else if(localName == "soju"){
        subTitle.innerHTML = "소주 >";
        name.innerHTML = sojuName[localIdx];
        price.innerHTML = "가격 : " + sojuPrice[localIdx] + " 원";
        dosu.innerHTML = "알콜 도수 : " + sojuDosu[localIdx] + "%";
        jujoArea.innerHTML = "주조 지역 : " + sojuJujoArea[localIdx];
        jujosa.innerHTML = "주조사 : " + sojuJujoArea[localIdx];
        descript.innerHTML = "상세 설명 : " + sojuDescript[localIdx];
        alcholImg[0].src = sojuPic[localIdx];
    }

    
    let heartName = localStorage.getItem("heartName");
    let heartIdx = localStorage.getItem("heartIdx");
    let heartImg = document.getElementById("heartImg");

    let heartNameArr = heartName.split(",");
    let heartIdxArr = heartIdx.split(",");
    for(let idx = 0; idx < heartIdxArr.length; idx++){
        if(localIdx === heartIdxArr[idx] && localName === heartNameArr[idx]){
            heartImg.src ="./../img/on_heart.png";
            break;
        }
    }
    
}

// ----------------- 술 상품 찜 버튼 ------------------------
let heartClick = true;
function choiceHeart(){

    // heartClick -> ture일 시
    if(heartClick){
        heartImg.src ="./../img/on_heart.png";
        heartClick = false;
    }else{
        heartImg.src = "./../img/off_heart.png";
        heartClick = true;
    }

    
    //------ 찜 버튼을 클릭 시 localStorage에 데이터 저장 한번 더 클릭 시 저장된 데이터 삭제
    let heartName = localStorage.getItem("heartName");
    let heartIdx = localStorage.getItem("heartIdx");
    let localName = localStorage.getItem("name");
    let localIdx = localStorage.getItem("idx");
    
    if(heartName === null){
        heartName = "";
    }

    if(heartIdx === null){
        heartIdx = "";
    }

    let localIdxArr = localIdx.split(",");
    let localNameArr = localName.split(",");
    let vheartNameArr = heartName.split(",");
    let vheartIdxArr = heartIdx.split(",");

    // 클릭 시 localIdx, localName 배열 -> heart에 idx와 name의 배열값과 일치할 시 데이터 제거
    for(let idx = 0; idx < vheartIdxArr.length; idx++){    
        if(localIdxArr[0] === vheartIdxArr[idx] && localNameArr[0] === vheartNameArr[idx]){
            alert("찜 목록에서 제거되었습니다.");
            let vheartNameSlice = vheartNameArr.slice(idx + 1);
            let vheartIdxSlice = vheartIdxArr.slice(idx + 1);

            let vheartNameStr = vheartNameSlice.join(",");
            let vheartIdxStr = vheartIdxSlice.join(",");

            localStorage.setItem("heartName", vheartNameStr);
            localStorage.setItem("heartIdx", vheartIdxStr);

            return;
        }
    }

    // 일치하지 않을 시 데이터 유지
    alert("찜 목록에 추가되었습니다.");
    vheartNameArr.push(localName);
    vheartIdxArr.push(localIdx);

    let vheartNameStr = vheartNameArr.join(",");
    let vheartIdxStr = vheartIdxArr.join(",");

    localStorage.setItem("heartName", vheartNameStr);
    localStorage.setItem("heartIdx", vheartIdxStr);
    
}

// ------------------------ 장바구니 버튼 -----------------------------
// Ex ] 상품 : 반슈잇콘 장바구니 클릭 시 localName, localIdx에 해당하는 데이터 cartName, cartIdx에
// split하여 덮붙여서 문자열로 데이터 저장 -> cartName, cartIdx
function putCart(){
    let localName = localStorage.getItem("name");
    let localIdx = localStorage.getItem("idx");

    let cartName = localStorage.getItem("cartName");
    let cartIdx = localStorage.getItem("cartIdx");

    let cartNameArr = cartName ? cartName.split(",") : [];
    let cartIdxArr = cartIdx ? cartIdx.split(",") : [];

    cartNameArr.push(localName);
    cartIdxArr.push(localIdx);

    let cartnameStr = cartNameArr.join(",");
    let cartIdxStr = cartIdxArr.join(",");
   
    localStorage.setItem("cartName", cartnameStr);
    localStorage.setItem("cartIdx", cartIdxStr);

    if(localName === "sake"){
        alert(sakeName[localIdx] + " 상품이 장바구니에 담겼습니다.");
    }else if(localName === "fruitwine"){
        alert(fruitwineName[localIdx] + " 상품이 장바구니에 담겼습니다.");
    }else if(localName === "beer"){
        alert(beerName[localIdx] + " 상품이 장바구니에 담겼습니다.");
    }else if(localName === "soju"){
        alert(sojuName[localIdx] + " 상품이 장바구니에 담겼습니다.");
    }
}