let sojuname;
let sujuprice;
function init(){
    sojuname =["고래의 흑보리 1800ml","하늘의 각인 1800ml", "오코게 1800ml", "무소유 1800ml", "무라마사 1800ml", "마루야마 1800ml",
     "쿠로사소리 1800ml", "몽상선락 1800ml", "악마의 포옹 1800ml", "야키이모쿠로세 1800ml", "사무라이의 문 1800ml", "자보 1800ml",
      "토리코 1800ml", "하오쿠보 레드캐스크 1800ml", "카메시즈쿠 1800ml", "무카시무카시 고주 1800ml", "하카이산 잘 부탁한다 1800ml",
      "토끼의 질주 600ml", "야바비진 1800ml", "토요나가쿠라 1800ml", "아사기리꽃 1800ml", "천벌 1800ml", "아마부키 1800ml", "토리카이 1800ml",
      "직화세이후쿠 1800ml", "잔파 백 1800ml", "야마카와 1800ml", "마사히로 1800ml", "무카시즈쿠리 스이코 1800ml", "하루사메카리 1800ml", 
      "타로 1800ml","즈이센 청룡 1800ml"];
    sojuprice =["43,000", "49,000", "40,300", "60,000", "40,000", "50,000", "53,000", "71,300", "70,000", "56,000", "80,000", "70,000",
    "50,000", "60,000", "100,000","70,000", "38,000", "48,000", "51,000", "61,000", "60,000", "44,000", "58,000", "51,000", "38,000", "48,000",
    "58,000", "40,000", "50,000", "70,000", "40,000", "38,000"];
}
